#!/usr/bin/env python
# coding: utf-8

# # 練習課題

# ## 問題 1 ある数字が素数かどうかをチェック
# 
# 素数とは、2 以上の自然数で、正の約数が 1 と自分自身のみであるもののことである。
# 
# 例えば、2, 3, 5, 7は素数である。一方で、$2\times3=6$のため、6は素数ではない。
# 
# 以下の文字列は素数かどうかをチェックするプログラムを書いてください。
# 
# - 素数である場合、「The number is a prime number」を出力する
# - 素数ではない場合、「The string is not a prime number」を出力する

# In[1]:


num = 39
# num = 29


# ## 問題2 区間内のすべての素数を表示する
# 
# 900から1000の間に素数である数字をリストに格納しなさい

# In[2]:


prime_nums=[]


# ## 問題3 フィボナッチ数列（Fibonacci sequence）
# 
# フィボナッチ数列は、先頭の2項目以外、一般項は前の2項目の和で表れることができる数列です。
# 定義は以下になります
# 
# $$
# fib(0)=0\\
# 
# fib(1)=1\\
# 
# fib(n+2) = fib(n) + fib(n+1) (n ≥ 0)
# $$
# 
# つまり、$0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, 233, 377$という規則の数列になります。
# 
# $nterms$個のフィボナッチ数列が格納されるリストを作成しなさい。

# In[3]:


nterms=20
n1, n2 = 0, 1
#　続きを書く


# In[ ]:





# In[ ]:




